Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་མགོན་པོ་སྦྱིན་སྲེག་འོད་འཕྲོ་ཡི། །སྐྱེ་ཡུལ་མཆོད་རྟེན་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The protector of the world, Hutārci, Will be born in a place called Shining Stūpa.

source: དེ་ཡི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་མེ་ཏོག་བཟང་། །སཱ་ལའི་བདག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one thousand leagues. “Excellent Flower will be his father, and Lady of Śāla Trees will be this victor’s mother.

source: སྲས་པོ་ཟླ་ལྡན་ཞི་ལྡན་རིམ་གྲོ་པ། །
en: Moon Possessor will be his son and Endowed with Peace his attendant.

source: ལེགས་མཐོང་དབྱངས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Melody of Excellent Sight the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཉིས་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་མཆོག་ལ་ངེས་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་འདུས་པར་འགྱུར། །
en: “There will be twelve consecutive congregations, Each of them gathering one billion Who are certain to attain awakening.

source: མི་ཚེ་ལོ་གྲངས་ལྔ་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be fifty-five thousand years,

source: དངོས་པོ་མེད་པར་ཕྱིན་པ་དེ་ཡི་ཆོས། །བྱང་ཆུབ་ཡོངས་སྨིན་བྱ་ཕྱིར་དམ་ཆོས་ཀུན། །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་གསུམ་དུ་གནས། །
en: “And when this teacher has gone beyond entities His sacred Dharma will remain for thirty million years. So that beings may mature toward awakening,

source: ཡོན་ཏན་མཐའ་ཡས་གཟི་བརྗིད་ཕུང་པོ་ཡི། །སྐྱེ་ཡུལ་ཆོས་ཀྱི་ཡོན་ཏན་འབྱུང་གནས་ཡིན། །
en: “Ananta­guṇa­tejorāśi will be born In a place called Source of Qualities.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ལྔ་བཅུ་རྩ་དྲུག་ཡབ་ནི་ལྷ་དབང་ཡིན། །ཐར་པའི་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend fifty-six leagues. “Divine Ruler will be his father, and Mode of Liberation will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་འོད་ལྡན་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Radiant his attendant.

source: ལྷ་ཡི་གཞལ་མེད་འདོད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Wish for the Divine Palace the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །རི་དབང་རྒྱལ་པོ་མི་གཡོ་སྤ་བ་བཞིན། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be twenty consecutive congregations, Each of them gathering three hundred forty million Who remain majestically unshakable, like the king of mountains.

source: སྣང་བ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བཞི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone beyond appearances His sacred Dharma will remain for forty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅོ་ལྔ་པ་གཅིག་ཤིན་ཏུ་རྣམ་པར་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Fifteen leagues large and exquisitely adorned.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་དག་གི །སྐྱེ་བའི་ཡུལ་ནི་མཐོང་བས་མཆོད་ཅེས་བྱ། །
en: “The thus-gone Siṃhavikrāmin Will be born in a place called Worship through Seeing.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཕན་འདོད་ཡིན། །ནོར་ལྷའི་བུ་འོད་ཅེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Wish to Benefit will be his father, and Light of the Child of the Wealth God will be this victor’s mother.

source: སྲས་པོ་ཏོག་ལྡན་འོད་འཕྲོ་རིམ་གྲོ་པ། །
en: Crest Possessor will be his son and Radiant his attendant.

source: སེང་གེ་བློ་གྲོས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Lion Intelligence will be the scholar

source: རྣམ་པར་སྒྲོགས་པའི་དབྱངས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Melodious Teaching the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་མཆོག་རབ་ཆོས་ལ་ངེས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred thirty million Who are certain to attain the factors of supreme awakening.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་སྟོང་ཕྲག་མཐའ་ཡས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will be abundant, Residing in thousands of stūpas adorned in infinite ways.

source: འཇིག་རྟེན་མགོན་པོ་མི་གཡོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་བསོད་ནམས་རབ་ཏུ་གནས་ཞེས་བྱ། །
en: “The protector of the world, Acala, Will be born in a place called Abiding Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཐེར་འབུམ་ཡབ་ནི་ཡོན་ཏན་དོན། །ལྷ་ཡི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one billion leagues. “Meaningful Qualities will be his father, and Ruler of Gods will be this victor’s mother.

source: སྲས་པོ་སྣང་ལྡན་འོད་བཟངས་རིམ་གྲོ་པ། །
en: Endowed with Light will be his son and Excellent Light his attendant.

source: རྒྱན་བྱིན་པ་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Adornment Gift will be the scholar

source: སྒྲོན་མ་ཁྱད་པར་འཕགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Superior Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཞི་བ་དག་ལ་གཞོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering two hundred twenty million Worthy ones who are immersed in peace.

source: དམ་ཆོས་ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས། །
en: “And the sacred Dharma will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །འཕང་དུ་དཔག་ཚད་གཅིག་སྲིད་འཕགས་པ་ལ། །རིན་ཆེན་ནོར་བུ་གསེར་གྱི་ལྡ་ལྡིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Rising one league tall And decorated with precious gems and golden tassels.

source: འཇིག་རྟེན་མགོན་པོ་རབ་གསལ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འཇིགས་པ་མེད་པར་མཐོང་ཞེས་བྱ། །
en: “The protector of the world, Prasanna, Will be born in a place called Fearless Seeing.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་བསྟོད་པའི་འོད། །འོད་གསལ་བ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Light of Praise will be his father, and Luminous will be this victor’s mother.

source: སྲས་པོ་ལྷ་མིན་རྒྱལ་བྱིན་རིམ་གྲོ་པ། །
en: Demigod will be his son and Royal Gift his attendant.

source: དགྲ་བཅོམ་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Mode of the Worthy Ones will be the scholar

source: སྒྲིབ་པ་མེད་པའི་ཏོག་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Unobscured Crest the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དྲི་མ་ཀུན་དང་བྲལ་བས་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering three hundred forty million Meditators free from all stains.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་ཆིག་སྟོང་ཡིན། །
en: The lifespan of humans will be thirty-one thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And after this victor has attained nirvāṇa His sacred Dharma will remain for thirty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་ཡང་འབྱུང་། །
en: The relics of this victor will be abundant, And there will appear one trillion stūpas.

source: དེ་བཞིན་གཤེགས་པ་འོད་ནི་སྤྱོད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་དགའ་ཞེས་བྱ། །
en: “The thus-gone Cīrṇaprabha will be born In a place called Constant Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་མྱོས་མེད་ཡིན། །བསོད་ནམས་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend sixty leagues. “Free from Intoxication will be his father, and Supreme Merit will be this victor’s mother.

source: སྲས་པོ་ལྷ་ལྡན་སྡོམ་པ་རིམ་གྲོ་པ། །
en: Endowed with Divinity will be his son and Observant his attendant.

source: བསོད་ནམས་དཔལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Merit will be the scholar

source: འཁྲུག་པ་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Undisturbed Rest the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གསུམ་ཀུན་ལ་ཡང་། །ཆགས་པ་མེད་པར་གྱུར་པའི་བསམ་གཏན་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be thirteen consecutive congregations, Each of them gathering one billion Meditators who are free attachment.

source: དམ་ཆོས་ལོ་གྲངས་ཆིག་ཁྲི་སུམ་སྟོང་གནས། །
en: “And the sacred Dharma will remain for thirteen thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དག་ནི་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་རྒྱན་གྱིས་བརྒྱན་བྱས་ཤིང་། །རྩེ་མོ་རིན་པོ་ཆེ་ཡིས་རབ་ཏུ་བརྒྱན། །
en: His relics will reside in a single stūpa Eight leagues large, adorned with ornaments, And featuring a jewel summit.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་དབྱངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཀླུ་ཡིས་མཆོད་པ་བྱས་ཞེས་བྱ། །
en: “The thus-gone Nāgaruta will be born In a place called Offered by Nāgas.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་རྒྱ་ཆེན་ཡིན། །ཀླུ་ཡི་དབྱངས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Vast will be his father, and Nāga Melody will be this victor’s mother.

source: སྲས་པོ་རྫུ་འཕྲུལ་སེང་གེ་རིམ་གྲོ་པ། །
en: Miracle will be his son and Lion his attendant.

source: དགའ་བས་མཆོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Worship through Joy will be the scholar

source: སྟོན་པ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག །
en: And Teacher the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ལྷ་ཡི་གནས་པ་མཆོག་དག་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven hundred forty million Who have attained the supreme divine abodes.

source: ཐུགས་རྗེ་ཆེན་པོ་མྱ་ངན་འདས་ནས་ཀྱང་། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: After this victor of great compassion has attained nirvāṇa His relics will be abundant.

source: དེ་བཞིན་གཤེགས་པ་གླུ་དབྱངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དབྱངས་ཀྱི་མཆོག་མ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Saṃgīti will be born In a place called Supreme Melody.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་བློ་གྲོས་ཅན། །དགེ་བའི་བློ་གྲོས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Intelligent will be his father, and Virtuous Intelligence will be this victor’s mother.

source: སྲས་པོ་བྱམས་ལྡན་གྲོགས་བཟང་རིམ་གྲོ་པ། །
en: Endowed with Loving Kindness will be his son and Excellent Companion his attendant.

source: ཆུ་བོ་སྤོང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Leaving the River Behind will be the scholar

source: གཟི་བརྗིད་རྣམ་པར་ངེས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Definitive Splendor the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །མཚུངས་མེད་ཆུ་དང་མཚུངས་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred ninety million Meditators who are like incomparable water.

source: སྲིད་པའི་མཐར་ཕྱིན་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone to the ends of existence His sacred Dharma will also remain for eighty thousand years.

source: མཆོད་རྟེན་རིན་པོ་ཆེ་ཡིས་རབ་ཏུ་བརྒྱན། །བ་དན་དག་གིས་ཤིན་ཏུ་མཛེས་པར་བྱས། །
en: His stūpa will be adorned with jewels And decorated with beautiful banners.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་ལོ་འཛིན་པ་ཡི། །སྐྱེ་ཡུལ་ཐུབ་པ་མེད་པའི་སྡེ་ཞེས་བྱ། །
en: “The thus-gone Cakradhara will be born In a place called Invincible Army.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལྷ་དབང་ཡིན། །ཚོགས་རྒྱལ་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Divine Ruler will be his father, and Light of the Victorious Gathering will be this victor’s mother.

source: སྲས་པོ་འབྱོར་པ་ལྷས་བྱིན་རིམ་གྲོ་པ། །
en: Wealth will be his son and Given by the Gods his attendant.

source: ཐུབ་པ་མེད་པའི་འོད་ནི་མཁས་པ་སྟེ། །
en: Invincible Light will be the scholar

source: བཀོད་པ་ཁྱད་པར་འཕགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Superior Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཉིས་ཀུན་ལ་ཡང་། །མཉམ་གྲོལ་རྒྱ་མཚོ་འདྲ་བའི་དགྲ་བཅོམ་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be twelve consecutive congregations, Each of them gathering one billion Worthy ones who are like an even ocean of liberation.

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has perfected liberation His sacred Dharma will also remain for thirty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་དབྱིག་གི་མཆོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་རྐང་པ་བརྒྱན་ཞེས་བྱ། །
en: “The thus-gone Vasuśreṣṭha will be born In a place called Adorned Limbs.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཁྲི་ཡོད་ཡབ་ནི་ཕན་འདོད་ཡིན། །དགའ་བའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten thousand leagues. “Wish to Benefit will be his father, and Light of Joy will be this victor’s mother.

source: སྲས་པོ་ཟླ་བ་ཟླ་བཟངས་རིམ་གྲོ་པ། །
en: Moon will be his son and Moonlight his attendant.

source: མུན་དང་བྲལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Free from Darkness will be the scholar

source: ཆགས་དང་བྲལ་བར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding by Freedom from Attachment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །ལྷ་ཡི་མཐུ་ཅན་རྣམ་གྲོལ་དགའ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be eleven consecutive congregations, Each of them gathering nine hundred ninety million Powerful gods who delight in liberation.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་ཆིག་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-one thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གསུམ་པ་གཅིག་གསེར་གྱི་བླ་རེར་ལྡན། །
en: The relics of this victor will reside in a single stūpa Thirteen leagues large and adorned with gold canopies.

source: སངས་རྒྱས་འཇིག་རྟེན་དག་ལ་དགའ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་ཀྱི་འོད་ཅེས་བྱ། །
en: “The buddha Lokapriya will be born In a place called Bright Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་རྒྱ་མཚོ་ཡིན། །ལྷ་ཡི་བློ་གྲོས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Ocean will be his father, and Divine Intelligence will be this victor’s mother.

source: སྲས་པོ་མི་ཕོ་བྲང་སྐྱེས་རིམ་གྲོ་པ། །
en: Man will be his son and Child his attendant.

source: གྲགས་ཆེན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Great Fame will be the scholar

source: ཁ་ལོ་སྒྱུར་བར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Leader the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐེ་ཙོམ་ཡིད་གཉིས་དག་ནི་མཐར་བྱེད་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་ཅུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred million Who liberate beings from doubt and indecision.

source: འཇིག་རྟེན་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And for the benefit of the world The sacred Dharma will remain for eighty-four thousand years.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: When this incomparable being has attained nirvāṇa The relics of this victor will be abundant.

source: བདེ་བར་གཤེགས་པ་ཆོས་ཀྱི་ཟླ་བ་ཡི། །སྐྱེ་ཡུལ་ཆོས་ཀྱི་བསྟན་པ་ཞེས་ཀྱང་བྱ། །
en: “The well-gone Dharmacandra will be born In a place called Dharma Teaching.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཐབས་ལྡན་ཡིན། །ཤེས་རབ་བརྟན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend nine leagues. “Skillful will be his father, and Stable Insight will be this victor’s mother.

source: སྲས་པོ་ལྷ་ལྡན་བརྟན་པ་རིམ་གྲོ་པ། །
en: Endowed with Divinity will be his son and Steadfast his attendant.

source: ཆོས་བརྟན་རབ་ཏུ་གནས་པ་ཤེས་རབ་ཅན། །
en: Abiding of Enduring Dharma will be the one of insight

source: བདེན་པ་ཅི་ཡི་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Diversely Abiding Truth the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དམ་པའི་ཆོས་ནི་མཁྱེན་རབ་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་རེ་རེ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred million Who dwell in comprehensive knowledge of the sacred Dharma.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this victor has attained nirvāṇa His sacred Dharma will remain for ten million years.

source: རྒྱལ་བ་དེ་ཡི་སྐུ་གདུང་རྒྱས་པར་འགྱུར། །
en: The relics of this victor will be abundant.

source: སངས་རྒྱས་དགའ་བ་མཐའ་ཡས་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡི་འོད་ཅེས་བྱ། །
en: “The buddha Ananta­rati­kīrti will be born In a place called Divine Light.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་ཡི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Excellent Divinity will be his father, and Divine Light will be this victor’s mother.

source: སྲས་པོ་ས་ལྡན་དགའ་བྱེད་རིམ་གྲོ་པ། །
en: Ground Possessor will be his son and Delighter his attendant.

source: སྒྲ་སྙན་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Delightful Tone will be the scholar

source: བདེ་བའི་སྟབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Force of Bliss the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཉོན་མོངས་ཐམས་ཅད་མཐར་ནི་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred forty million Who achieve liberation from all defilements.

source: དངོས་མེད་ཕྱིན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone beyond entities The sacred Dharma will remain for one thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཆོས་སྣང་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Meghadhvaja will be born In a place called Dharma Illumination.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་འབུམ་ཡོད་ཡབ་ནི་ཡོན་ཏན་འོད། །བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred thousand leagues. “Luminous Qualities will be his father, and Ocean of Intelligence will be this victor’s mother.

source: སྲས་པོ་ཤེས་བྱིན་ལེགས་ཤེས་རིམ་གྲོ་པ། །
en: Insight Gift will be his son and Excellent Insight his attendant.

source: མྱ་ངན་འདས་སྟེགས་བཟང་པོ་རྫུ་འཕྲུལ་ཅན། །
en: And Excellent Steps to Nirvāṇa the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ཚངས་པར་གནས་པའི་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering three hundred twenty million Who have perfected the abodes of Brahmā.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: When this knower of the world has attained nirvāṇa, His relics of will be abundant.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་འགྲོས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་གཞོལ་ཞེས་བྱ། །
en: “The thus-gone Prajñāgati will be born In a place called Merging with Wisdom.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་སྟོང་དྲུག་བརྒྱ་ཡབ་ནི་སྟེགས་བཟང་ཡིན། །ཤེས་རབ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family of will be brahmin And his light will extend three thousand six hundred leagues. “Excellent Steps will be his father, and Insight Joy will be this victor’s mother.

source: སྲས་པོ་མཆོག་མ་སྤྲིན་ལྡན་རིམ་གྲོ་པ། །
en: Supreme will be his son and Cloud Bearer his attendant.

source: བདུད་འཇོམས་པ་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Māra Conqueror will be the one of intelligence

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་དྲུག་ཀུན་ལའང་། །བྱང་ཆུབ་མཆོག་གི་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty-six consecutive congregations, Each of them gathering nine hundred forty million Who have gone to the far side of supreme awakening.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained nirvāṇa The sacred Dharma will remain for seventy-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་ནོར་བུ་བླ་རེར་ལྡན། །
en: The relics of this victor will reside in a single stūpa Five leagues large and adorned with jewel canopies.

source: འཇིག་རྟེན་མགོན་པོ་སྤོས་བཟང་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སྤོས་ཀྱིས་རྣམ་པར་བརྒྱན་ཞེས་བྱ། །
en: “The protector of the world, Sugandha, Will be born in a place called Adorned with Fragrance.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལེགས་བཟངས་ཡིན། །འོད་བཟངས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Exquisite Excellence will be his father, and Excellent Light will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་འབྱོར་པ་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Wealth his attendant.

source: ཡོན་ཏན་འོད་བཟངས་པ་ནི་མཁས་པ་སྟེ། །
en: Excellent Light of Qualities will be the scholar

source: བཀོད་པ་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །མཚོ་བྲན་རྒྱ་མཚོ་གང་བ་འདྲ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be thirty-two consecutive congregations, Each of them gathering seven hundred forty million Who are like lakes expanding into the sea.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has perfected peace His sacred Dharma will remain for thirty-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ཐམས་ཅད་རྣམ་པར་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa Eight leagues large and decorated throughout.

source: དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་དབྱིངས་སྐྱེ་བའི། །ཡུལ་ནི་རྫུ་འཕྲུལ་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Gaganasvara Will be born in a place called Miraculous Illumination.

source: རྡུལ་བྲལ་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །སྟོང་གསུམ་ཙམ་ཡིན་བདེ་བའི་དབང་པོ་ཡབ། །དགའ་བའི་སྒྲ་དབྱངས་རྒྱལ་ཡུམ་མེ་ཏོག་སྲས། །ཀུ་མུ་ད་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: The family of this immaculate one will be kṣatriya, And his light will extend as far as the trichiliocosm. “Bliss Ruler will be his father, and Melody of Joy will be this victor’s mother. Flower will be his son and Kumuda his attendant.

source: སེང་གེའི་རྒྱལ་མཚན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Lion Banner will be the scholar

source: དབྱངས་སྙན་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་མཐའ་ཡས་ཀུན་ལ་ཡང་། །བརྟན་རྣམས་བྱང་ཆུབ་དག་ལ་གཞོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དཔག་ཏུ་མེད་པ་ཡོད། །
en: “There will be infinitely many congregations, Each of them gathering infinitely numerous millions Of steadfast bodhisattvas committed to awakening.

source: མི་ཚེ་ལོ་གྲངས་ཐེར་འབུམ་ཕྲག་གསུམ་ཡིན། །
en: The lifespan of humans will be three billion years,

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་ཐེར་འབུམ་ཕྲག་གསུམ་གནས། །
en: “And for the sake of ripening beings toward awakening His sacred Dharma will remain for three billion years.

source: གྲགས་པ་མཐའ་ཡས་མྱ་ངན་འདས་ནས་ཀྱང་། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: When this victor of infinite fame has attained nirvāṇa His relics will be abundant.

source: འཇིག་རྟེན་མགོན་པོ་ལྷ་ཡི་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ངང་ཚུལ་ཀུན་དུ་སྡུད་ཞེས་བྱ། །
en: “The protector of the world, Deva, Will be born in a place called Embodiment of the Natural State.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །སྟོང་ཁམས་གཉིས་ཙམ་ཡབ་ནི་སྒྲོན་མ་ཡིན། །སྤོབས་པའི་བློ་གྲོས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend as far as a millionfold world. “Lamp will be his father, and Intelligent Acumen will be this victor’s mother.

source: སྲས་པོ་ལྷ་གསལ་འབྱོར་བྱེད་རིམ་གྲོ་པ། །
en: Divine Clarity will be his son and Winner his attendant.

source: མིག་ལེགས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Excellent Eye will be the scholar

source: ཤིན་ཏུ་སྦྱངས་པའི་ལུས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Highly Purified Body the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་བཞི་ཀུན་ལའང་། །སེམས་ཅན་མཆོག་མ་བྱང་ཆུབ་འདོད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་དགུ་དགུ་ཡོད། །
en: “There will be sixty-four consecutive congregations, Each of them gathering nine hundred billion Supreme sentient beings who wish for awakening.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for eighty million years.
